bodyWorkday

<?xml version="1.0" encoding="UTF-8"?>
 <env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
<env:Body>
<wd:Get_Workers_Request xmlns:wd="urn:com.workday/bsvc" wd:version="v45.0">
             <wd:Request_Criteria>
                 <wd:Transaction_Log_Criteria_Data>
<wd:Transaction_Date_Range_Data>
<wd:Effective_From>2025-10-08T01:00:00.000-07:00</wd:Effective_From>
<wd:Effective_Through>2026-03-22T22:59:59.000-08:00</wd:Effective_Through>
</wd:Transaction_Date_Range_Data>
</wd:Transaction_Log_Criteria_Data>
  <wd:Organization_Reference>
<wd:ID wd:type="Organization_Reference_ID">S-20016479</wd:ID>
</wd:Organization_Reference>
                 <wd:Include_Subordinate_Organizations>true</wd:Include_Subordinate_Organizations>
                 <wd:Field_And_Parameter_Criteria_Data>
<wd:Provider_Reference>
<wd:ID wd:type="Integration_System_ID">
                            INTSG605_HDB_001_API_SailPoint_Get_Worker_Outbound
</wd:ID>
</wd:Provider_Reference>
</wd:Field_And_Parameter_Criteria_Data>
                 <wd:Exclude_Inactive_Workers>false</wd:Exclude_Inactive_Workers>
<wd:Exclude_Employees>false</wd:Exclude_Employees>
<wd:Exclude_Contingent_Workers>false</wd:Exclude_Contingent_Workers>
             </wd:Request_Criteria>
             <wd:Response_Filter>
<wd:Page>1</wd:Page>
<wd:Count>20</wd:Count>
<wd:As_Of_Effective_Date>2025-11-02+08:00</wd:As_Of_Effective_Date>
</wd:Response_Filter>
             <wd:Response_Group>
<wd:Include_Additional_Jobs>true</wd:Include_Additional_Jobs>
<wd:Exclude_Companies>false</wd:Exclude_Companies>
<wd:Exclude_Company_Hierarchies>true</wd:Exclude_Company_Hierarchies>
<wd:Exclude_Cost_Center_Hierarchies>false</wd:Exclude_Cost_Center_Hierarchies>
<wd:Exclude_Cost_Centers>false</wd:Exclude_Cost_Centers>
<wd:Exclude_Custom_Organizations>false</wd:Exclude_Custom_Organizations>
<wd:Exclude_Location_Hierarchies>true</wd:Exclude_Location_Hierarchies>
<wd:Exclude_Matrix_Organizations>true</wd:Exclude_Matrix_Organizations>
<wd:Exclude_Organization_Support_Role_Data>true</wd:Exclude_Organization_Support_Role_Data>
<wd:Exclude_Pay_Groups>true</wd:Exclude_Pay_Groups>
<wd:Exclude_Region_Hierarchies>true</wd:Exclude_Region_Hierarchies>
<wd:Exclude_Regions>true</wd:Exclude_Regions>
<wd:Exclude_Supervisory_Organizations>false</wd:Exclude_Supervisory_Organizations>
<wd:Exclude_Teams>true</wd:Exclude_Teams>
<wd:Include_Account_Provisioning>false</wd:Include_Account_Provisioning>
<wd:Include_Background_Check_Data>false</wd:Include_Background_Check_Data>
<wd:Include_Benefit_Eligibility>true</wd:Include_Benefit_Eligibility>
<wd:Include_Benefit_Enrollments>false</wd:Include_Benefit_Enrollments>
<wd:Include_Career>false</wd:Include_Career>
<wd:Include_Compensation>false</wd:Include_Compensation>
<wd:Include_Development_Items>false</wd:Include_Development_Items>
<wd:Include_Employee_Contract_Data>false</wd:Include_Employee_Contract_Data>
<wd:Include_Employee_Review>false</wd:Include_Employee_Review>
<wd:Include_Employment_Information>true</wd:Include_Employment_Information>
<wd:Include_Feedback_Received>false</wd:Include_Feedback_Received>
<wd:Include_Goals>false</wd:Include_Goals>
<wd:Include_Management_Chain_Data>true</wd:Include_Management_Chain_Data>
<wd:Include_Organizations>true</wd:Include_Organizations>
<wd:Include_Personal_Information>true</wd:Include_Personal_Information>
<wd:Include_Qualifications>false</wd:Include_Qualifications>
<wd:Include_Reference>false</wd:Include_Reference>
<wd:Include_Related_Persons>false</wd:Include_Related_Persons>
<wd:Include_Roles>false</wd:Include_Roles>
<wd:Include_Skills>false</wd:Include_Skills>
<wd:Include_Succession_Profile>false</wd:Include_Succession_Profile>
<wd:Include_Talent_Assessment>false</wd:Include_Talent_Assessment>
<wd:Include_User_Account>true</wd:Include_User_Account>
<wd:Include_Worker_Documents>false</wd:Include_Worker_Documents>
<wd:Include_Transaction_Log_Data>true</wd:Include_Transaction_Log_Data>
</wd:Response_Group>
         </wd:Get_Workers_Request>
</env:Body>
</env:Envelope>
